In [45]:
d1 = {'d1':[1,2,3,4,5],'d2':[1,2,3,4,5]}
d2 = {'d1':[6,7,8,9,10],'d2':[6,7,8,9,10]}

In [46]:
import pandas as pd

In [47]:
df1 = pd.DataFrame(d1)

In [48]:
df2 = pd.DataFrame(d2)

In [49]:
df1

   d1  d2
0   1   1
1   2   2
2   3   3
3   4   4
4   5   5

In [50]:
df2

   d1  d2
0   6   6
1   7   7
2   8   8
3   9   9
4  10  10

In [52]:
cum_sum = df1.add(df2)

In [55]:
cum_sum.div(1.0)

     d1    d2
0   7.0   7.0
1   9.0   9.0
2  11.0  11.0
3  13.0  13.0
4  15.0  15.0